import Contacts from '@/components/ui/contacts';
import Container from '@/components/ui/container';

const Delivery = () => {
  return (
    <Container>
      <article className="p-4 sm:p-6 lg:p-8">
        <h1 className="text-xl font-bold p-5">
          Вітаємо в інтернет-магазині дитячих книг &quot;Мишка&quot;!
        </h1>
        <p>
          Ми створили місце, де для кожної дитини можна знайти цікаву й
          захоплюючу історію. У нас є книги для дітей від 0 до 12 років, що
          допомагають розвивати уяву, допитливість і звісно любов до читання.
          Від яскравих казок для малюків до пізнавальних енциклопедій – наш
          асортимент постійно поповнюється новинками. Також у нас є вибір
          літератури для батьків, щоб дорослі теж могли отрмати поради щодо
          виховання діток. Ми віримо, що книга – це не лише джерело знань, а й
          спосіб цікаво та захопливо провести час.
        </p>
        <hr className="m-2" />
        <p className="mb-2">
          Звертайтесь до нас - ми радо допоможемо підібрати книгу для вашої
          дитини!
        </p>
        <Contacts />
      </article>
    </Container>
  );
};

export default Delivery;
