const Agreement = () => {
  return (
    <div className="container mx-auto p-5">
      <h1 className="text-xl font-bold p-5">Договір публічної оферти</h1>
      <hr />
      <section>
        <h3 className="text-l p-2">1. ЗАГАЛЬНІ ПОЛОЖЕННЯ </h3>
        <div>
          1.1. Справжня оферта є офіційною пропозицією інтернет-сайту Продавця
          {process.env.DOMAIN}, далі за текстом — «Продавець», укласти Договір
          купівлі-продажу товарів дистанційним способом, тобто через
          Інтернет-магазин, далі за текстом — «Договір », та розміщує Публічну
          оферту (пропозицію) на офіційному інтернет-сайті Продавця
          {process.env.DOMAIN} (далі – «Інтернет-сайт»).
        </div>
        <div>
          1.2. Моментом повного та безумовного прийняття Покупцем пропозиції
          Продавця (акцептом) укласти електронний договір купівлі-продажу
          товарів, вважається факт оплати Покупцем замовлення на умовах цього
          Договору, у строки та за цінами, зазначеними на Інтернет-сайті
          Продавця.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">2. ПОНЯТТЯ ТА ВИЗНАЧЕННЯ</h3>
        <div>
          2.1. У цій оферті, якщо контекст не вимагає іншого, нижченаведені
          терміни мають такі значення:
        </div>
        <div>
          2.1.1. «Товар» — продукція, яка продається на Інтернет-сайті Продавця.
        </div>
        <div>
          2.1.2. «Інтернет-магазин» - відповідно до Закону України «Про
          електронну комерцію», засіб для подання або реалізації товару, роботи
          чи послуги шляхом вчинення електронної угоди.
        </div>
        <div>
          2.1.3. «Продавець» - реалізує товари, представлені на Інтернет-сайті.
        </div>
        <div>
          2.1.4. «Покупець» - фізична або юридична особа, яка прийняла умови
          цієї оферти і оплатила замовлення.
        </div>
        <div>
          2.1.5. «Замовлення» - вибір Покупцем товарів з переліку, який
          представлений на Інтернет-сайті, та оформлення заявки на придбання цих
          товарів.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">3. ПРЕДМЕТ ДОГОВОРУ</h3>
        <div>
          3.1. Продавець зобов&apos;язується передати у власність Покупця Товар,
          а Покупець зобов&apos;язується сплатити та прийняти Товар на умовах
          цього Договору.
        </div>
        <div>
          Цей Договір регулює купівлю-продаж товарів в Інтернет-магазині,
          зокрема:
        </div>
        <div>- Добровільний вибір Покупцем товарів в Інтернет-магазині;</div>
        <div>
          - Самостійне оформлення Покупцем замовлення в Інтернет-магазині;
        </div>
        <div>
          - Оплата Покупцем замовлення, оформленого в Інтернет-магазині;
        </div>
        <div>- Добровільний вибір Покупцем товарів в Інтернет-магазині;</div>
        <div>
          - Самостійне оформлення Покупцем замовлення в Інтернет-магазині;
        </div>
        <div>
          - Оплата Покупцем замовлення, оформленого в Інтернет-магазині;
        </div>
        <div>
          - Обробка та доставка замовлення Покупцеві у власність на умовах цього
          Договору.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">4. ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</h3>
        <div>
          4.1. Покупець має право оформити замовлення на будь-який товар,
          представлений на Сайті Інтернет-магазину та наявний.
        </div>
        <div>
          4.2. Кожна позиція може бути представлена ​​в замовлення у будь-якій
          кількості.
        </div>
        <div>
          4.3. За відсутності товару на складі, Менеджер компанії
          зобов&apos;язаний повідомити Покупця (по телефону або через електронну
          пошту).
        </div>
        <div>
          4.4. За відсутності товару Покупець має право замінити його товаром
          аналогічної моделі, відмовитися від цього товару, анулювати
          замовлення.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">5. ПОРЯДОК ОПЛАТИ ЗАМОВЛЕННЯ</h3>
        <div>Накладеним платежем</div>
        <div>
          5.1. Оплата здійснюється за фактом отримання товару у відділенні
          транспортних компаній за готівку в гривнях.
        </div>
        <div>
          5.2. При не надходженні коштів Інтернет-магазин залишає за собою право
          анулювати замовлення.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">6. УМОВИ ДОСТАВКИ ЗАМОВЛЕННЯ</h3>
        <div>
          6.1. Доставка товарів, придбаних в Інтернет-магазині, здійснюється до
          складів транспортних компаній, де й провадиться видача замовлень.
        </div>
        <div>
          6.2. Разом із замовленням Покупцеві надаються документи відповідно до
          законодавства України.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">7. ПРАВА ТА ОБОВ&apos;ЯЗКИ СТОРІН</h3>
        <div>7.1. Продавець має право:</div>
        <div>
          - в односторонньому порядку призупинити надання послуг за цим
          договором у разі порушення Покупцем умов цього договору.
        </div>
        <div>7.2. Покупець зобов`&apos;`язаний:</div>
        <div>
          - своєчасно сплатити та отримати замовлення на умовах цього договору.
        </div>
        <div>7.3. Покупець має право:</div>
        <div>- оформити замовлення в Інтернет-магазині;</div>
        <div>- оформити електронний договір;</div>
        <div>- вимагати від Продавця виконання умов цього Договору.</div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">8. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h3>
        <div>
          8.1. Сторони несуть відповідальність за невиконання або неналежне
          виконання умов цього договору у порядку, передбаченому цим договором
          та чинним законодавством України.
        </div>
        <div>8.2. Продавець не несе відповідальності за:</div>
        <div>- змінений виробником зовнішній вигляд Товару;</div>
        <div>
          - незначну невідповідність колірної гами товару, що може відрізнятися
          від оригіналу товару виключно через різну колірну передачу моніторів
          персональних комп&apos;ютерів окремих моделей;
        </div>
        <div>
          - зміст та правдивість інформації, що надається Покупцем під час
          оформлення замовлення;
        </div>
        <div>
          - затримку та перебої у наданні Послуг (обробки замовлення та доставки
          товару), що відбуваються з причин, що знаходяться поза сферою його
          контролю;
        </div>
        <div>
          - протиправні незаконні дії, здійснені Покупцем за допомогою цього
          доступу до мережі Інтернет;
        </div>
        <div>
          - передачу Покупцем своїх мережевих ідентифікаторів - IP, MAC-адреси,
          логіну та паролю третім особам;
        </div>
        <div>
          8.3. Покупець, використовуючи наданий йому доступ до мережі Інтернет,
          самостійно несе відповідальність за шкоду, заподіяну його діями
          (особисто, навіть якщо під її логіном знаходилася інша особа) особам
          або їхньому майну, юридичним особам, державі або моральним принципам
          моральності.
        </div>
        <div>
          8.4. У разі настання обставин непереборної сили сторони звільняються
          від виконання умов цього договору. Під обставинами непереборної сили
          для цілей цього договору розуміються події, що мають надзвичайний,
          непередбачуваний характер, які виключають або об&apos;єктивно
          заважають виконанню цього договору, настання яких Сторони не могли
          передбачити та запобігти розумним способам.
        </div>
        <div>
          8.5. Сторони докладають максимум зусиль для вирішення будь-яких
          розбіжностей лише шляхом переговорів.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">9. ІНШІ УМОВИ</h3>
        <div>
          9.1. Інтернет-магазин залишає за собою право в односторонньому порядку
          вносити зміни до цього договору за умови попередньої публікації його
          на сайті {process.env.DOMAIN}
        </div>
        <div>
          9.2. Інтернет-магазин створено для організації дистанційного способу
          продажу товарів через Інтернет.
        </div>
        <div>
          9.3. Покупець відповідає за достовірність зазначеної при оформленні
          замовлення інформації. При цьому, при здійсненні акцепту (оформлення
          замовлення та подальшої оплати товару) Покупець надає Продавцю свою
          беззастережну згоду на збирання, обробку, зберігання, використання
          своїх персональних даних у розумінні ЗУ «Про захист персональних
          даних».
        </div>
        <div>
          9.4. Оплата Покупцем оформленого в Інтернет-магазині замовлення
          означає повну згоду Покупця з умовами договору купівлі-продажу
          (публічної оферти)
        </div>
        <div>
          9.5. Фактичною датою електронної угоди між сторонами є дата прийняття
          умов відповідно до ст. 11 Закону України &quot;Про електронну
          комерцію&quot;.
        </div>
        <div>
          9.6. Використання ресурсу Інтернет-магазину для перегляду товару, а
          також для оформлення замовлення для Покупця є безкоштовним.
        </div>
        <div>
          9.7. Інформація, що надається Покупцем, є конфіденційною.
          Інтернет-магазин використовує інформацію про Покупця виключно з метою
          обробки замовлення, відправлення повідомлень Покупцю, доставки товару,
          здійснення взаєморозрахунків та ін.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">
          10. ПОРЯДОК ПОВЕРНЕННЯ ТОВАРУ НАЛЕЖНОЇ ЯКОСТІ
        </h3>
        <div>
          10.1. Повернення товару до Інтернет-магазину здійснюється відповідно
          до чинного законодавства України.
        </div>
        <div>
          10.2. Повернення товару до Інтернет-магазину здійснюється за рахунок
          Покупця.
        </div>
        <div>
          10.3. При поверненні Покупцем товару належної якості Інтернет-магазин
          повертає йому сплачену за товар грошову суму за фактом повернення
          товару за вирахуванням компенсації витрат Інтернет-магазину
          пов&apos;язаних з доставкою товару Покупцю.
        </div>
        <hr className="m-2" />
      </section>
      <section>
        <h3 className="text-l p-2">11. ТЕРМІН ДІЇ ДОГОВОРУ</h3>
        <div>
          11.1. Електронний договір вважається укладеним з моменту отримання
          особою, що направила пропозицію укласти такий договір, відповіді про
          прийняття цієї пропозиції у порядку, визначеному частиною шостою
          статті 11 Закону України &quot;Про електронну комерцію&quot;.
        </div>
        <div>
          11.2. До закінчення терміну дії цей Договір може бути розірваний за
          взаємною згодою сторін до моменту фактичної доставки товару шляхом
          повернення коштів
        </div>
        <div>
          11.3. Сторони мають право розірвати цей договір в односторонньому
          порядку, у разі невиконання однієї із сторін умов цього Договору та у
          випадках, передбачених чинним законодавством України.
        </div>
      </section>
    </div>
  );
};

export default Agreement;
