import Container from '@/components/ui/container';

const Delivery = () => {
  return (
    <Container>
      <div className="px-4 sm:px-6 lg:px-8">
        <h1 className="text-xl font-bold p-5">Доставка і оплата</h1>
        <section>
          <h3 className="text-l font-bold p-2">СПОСОБИ ДОСТАВКИ</h3>
          <p>
            1. Доставка Новою Поштою (до відділення або поштомату). Доставка
            замовлень на суму від 1500 грн. здійснюється за наш рахунок!
          </p>
          <p>
            2. Адресна доставка кур&apos;єром Нової Пошти. Завжди здійснюється
            за допомогою кур&apos;єра. Послуги кур&apos;єра оплачуються
            додатково&nbsp;
          </p>
          <p>3. Доставка Укрпоштою до відділення.&nbsp;</p>

          <p>Термін відправлення замовлення – 1-3 дні.</p>
          <hr className="m-2" />
        </section>
        <section>
          <h3 className="text-l p-2">ВАЖЛИВО!</h3>
          <p>
            Якщо книга вам потрібна терміново, повідомте нам про це! Доставка
            товарів здійснюється по всій території України. Термін доставки
            товару становить від 1 до 5 днів, залежно від місцезнаходження
            отримувача та обраного типу доставки.
          </p>
          <hr className="m-2" />
        </section>
        <section>
          <h3 className="text-l font-bold p-2">СПОСОБИ ДОСТАВКИ ПО УКРАЇНІ</h3>

          <h4 className="text-l font-semibold p-2">Доставка «Новою Поштою»</h4>
          <p>
            Компанія «Нова пошта» – лідер серед компаній, що надають послугу
            експрес доставки по Україні. Компанія продовжує відкривати нові
            відділення на всій території України і на сьогоднішній день має
            велику мережу відділень. Доставка може бути здійснена як на
            відділення Нової пошти, так і на Вашу адресу. Оплата товару можлива
            дома, при отриманні товару (накладений платіж). Термін доставки
            складає 1-2 дні з моменту відправлення. При отриманні Ви маєте
            можливість перевірити товар на цілісність та відповідність
            замовлення. У разі невідповідності або пошкодження товару необхідно
            скласти відповідний акт у присутності співробітника Нової пошти та
            відмовитися від отримання товару. Після отримання товару претензії
            до зовнішнього вигляду та комплектації не приймаються.
          </p>

          <h4 className="text-l font-semibold p-2">Доставка «Укрпоштою»</h4>
          <p>
            Компанія «Укрпоштою» – це найбільша мережа: понад 11000 відділень
            забезпечують покриття у 100% населених пунктів України. Доставка
            Укрпоштою – це оптимальне співвідношення ціни та якості послуг
            доставки. Вартість доставки залежить від ваги посилки та відстані.
          </p>
          <h4 className="text-l font-semibold p-2">МІЖНАРОДНА ДОСТАВКА</h4>
          <p>Ми також відправляємо книжечки по всьому світу!&nbsp;</p>
          <p>
            Ми це робимо з допомогою Нової Пошти, Укрпошти, Meest Express та
            іншими перевізниками.&nbsp;
          </p>
          <p>
            Для прорахунку вартості доставки звертайтесь до нас по вказаному
            номеру телефону в контактах&nbsp; або в приватні повідомлення в
            соціальних мережах.&nbsp;
          </p>
          <hr className="m-2" />
        </section>

        <section>
          <h3 className="text-l font-bold p-2">МОЖЛИВІ СПОСОБИ ОПЛАТИ</h3>
          <ul>
            <li>
              1. Картою будь-якого банку (Visa, MasterCard) – миттєва оплата на
              сайті.
            </li>
            <li>
              2. Оплата післяплатою при отриманні (при адресній доставці також
              можлива).
            </li>
            <li>
              3. Оплата на номер картки (офлайн) – висвітиться номер картки для
              оплати протягом 24 годин.
            </li>
            <li>
              ВАЖЛИВО! Не забудьте натиснути кнопку ПІДТВЕРДЖЕННЯ ЗАМОВЛЕННЯ!!
            </li>
            <li>Повідомте нам про оплату.</li>
            <li>
              4. Оплата по рахунку (Банківський переказ) - ми надішлемо рахунок
              для оплати на вказану електронну пошту.
            </li>
          </ul>
        </section>
      </div>
    </Container>
  );
};

export default Delivery;
