import Contacts from '@/components/ui/contacts';
import Container from '@/components/ui/container';

const Delivery = () => {
  return (
    <Container>
      <div className="p-4 sm:p-6 lg:p-8">
        <h1 className="text-xl font-bold p-5">Доставка і оплата</h1>
        <section>
          <h3 className="text-l font-bold p-2">СПОСОБИ ДОСТАВКИ</h3>
          <p>
            1. Доставка Новою Поштою (до відділення або поштомату). Доставка
            замовлень на суму від 1500 грн. здійснюється за наш рахунок!
          </p>
          <p>
            2. Адресна доставка кур&apos;єром Нової Пошти. Завжди здійснюється
            за допомогою кур&apos;єра. Послуги кур&apos;єра оплачуються
            додатково&nbsp;
          </p>
          <p>3. Доставка Укрпоштою до відділення.&nbsp;</p>

          <p>Термін відправлення замовлення – 1-3 дні.</p>
          <hr className="m-2" />
        </section>
        <section>
          <h3 className="text-l p-2">ВАЖЛИВО!</h3>
          <p>Якщо книга вам потрібна терміново, повідомте нам про це!</p>
          <hr className="m-2" />
        </section>
        <section>
          <h4 className="text-l font-semibold p-2">МІЖНАРОДНА ДОСТАВКА</h4>
          <p>Ми також відправляємо книжечки по всьому світу!&nbsp;</p>
          <p>
            Ми це робимо за допомогою Нової Пошти. <br /> Для оформлення
            замовлення оберіть на сайті книги і напишіть менеджеру в інстаграм
            або телеграм для уточнення способу оплати та адреси відправки.
            &nbsp;
          </p>
          <Contacts />
          <hr className="m-2" />
        </section>

        <section>
          <h3 className="text-l font-bold p-2">МОЖЛИВІ СПОСОБИ ОПЛАТИ</h3>
          <ul>
            <li>
              1. Оплата післяплатою при отриманні. Важливо!!! При відпраці
              Укрпоштою післяпалата неможлива.
            </li>
            <li>
              2. Оплата за реквізитами. Після оформлення замовлення, менеджер
              зателефонує і надасть реквізити для оплати на обраний Вами
              месенджер. Після здійснення оплати, будь ласка повідомте нас про
              це.
            </li>
            <li>
              3. Оплата онлайн на сайті за допомогою платіжної системи Mono Pay,
              ввівши номер карти або скориставшись Google Pay або Apple Pay.
            </li>
          </ul>
        </section>
      </div>
    </Container>
  );
};

export default Delivery;
